> Could you please paste the whole log output? `commoninit.cfg` seems to be completely broken.

Not sure which "log" you are asking for, but here is the entire front/back deployment process. Let me know what other files/logs you wish to see (of course those from the VMs are off limits, since I can't login there)

geeko@portebla:~/sandbox> git clone https://github.com/kubic-project/kubic-terraform-kvm.git
Cloning into 'kubic-terraform-kvm'...
remote: Enumerating objects: 10, done.
remote: Counting objects: 100% (10/10), done.
remote: Compressing objects: 100% (8/8), done.
remote: Total 115 (delta 4), reused 6 (delta 2), pack-reused 105
Receiving objects: 100% (115/115), 30.06 KiB | 480.00 KiB/s, done.
Resolving deltas: 100% (59/59), done.
geeko@portebla:~/sandbox> cd kubic-terraform-kvm/

geeko@portebla:~/sandbox/kubic-terraform-kvm> ./download-image.py 
downloading https://download.opensuse.org/repositories/devel:/kubic:/images/openSUSE_Tumbleweed/openSUSE-MicroOS.x86_64-Kubic-kubeadm-kvm-and-xen.qcow2
[==================================================] 100%
geeko@portebla:~/sandbox/kubic-terraform-kvm> terraform init

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "template" (hashicorp/template) 2.1.2...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.template: version = "~> 2.1"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
geeko@portebla:~/sandbox/kubic-terraform-kvm> terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.cloud_init_disk_user_data[0]: Refreshing state...
data.template_file.cloud_init_disk_user_data[1]: Refreshing state...
data.template_file.cloud_init_disk_user_data[2]: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # libvirt_cloudinit_disk.commoninit[0] will be created
  + resource "libvirt_cloudinit_disk" "commoninit" {
      + id        = (known after apply)
      + name      = "commoninit-0.iso"
      + pool      = "default"
      + user_data = <<~EOT
            #cloud-config
            
            # set locale
            locale: en_US.UTF-8
            # set timezone
            timezone: Etc/UTC
            
            hostname: kubic-0
            # you can also use ssh-keys with cloudinit. we use pwd for simplicity
            ssh_pwauth: True
            chpasswd:
              list: |
                 root:linux
              expire: False
            disable_root: false
            ssh_authorized_keys:
             - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv55y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPIQ0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared Key
            
            runcmd:
            #  - systemctl enable kubelet.service
            #  - systemctl enable --now crio.service
            #  - sed -i 's!KUBELET_EXTRA_ARGS="!KUBELET_EXTRA_ARGS="--cni-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet
              - sed  -i '/PermitRootLogin/s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config
              - systemctl restart sshd
              - modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4
            
            final_message: "The system is finally up, after $UPTIME seconds"
        EOT
    }

  # libvirt_cloudinit_disk.commoninit[1] will be created
  + resource "libvirt_cloudinit_disk" "commoninit" {
      + id        = (known after apply)
      + name      = "commoninit-1.iso"
      + pool      = "default"
      + user_data = <<~EOT
            #cloud-config
            
            # set locale
            locale: en_US.UTF-8
            # set timezone
            timezone: Etc/UTC
            
            hostname: kubic-1
            # you can also use ssh-keys with cloudinit. we use pwd for simplicity
            ssh_pwauth: True
            chpasswd:
              list: |
                 root:linux
              expire: False
            disable_root: false
            ssh_authorized_keys:
             - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv55y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPIQ0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared Key
            
            runcmd:
            #  - systemctl enable kubelet.service
            #  - systemctl enable --now crio.service
            #  - sed -i 's!KUBELET_EXTRA_ARGS="!KUBELET_EXTRA_ARGS="--cni-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet
              - sed  -i '/PermitRootLogin/s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config
              - systemctl restart sshd
              - modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4
            
            final_message: "The system is finally up, after $UPTIME seconds"
        EOT
    }

  # libvirt_cloudinit_disk.commoninit[2] will be created
  + resource "libvirt_cloudinit_disk" "commoninit" {
      + id        = (known after apply)
      + name      = "commoninit-2.iso"
      + pool      = "default"
      + user_data = <<~EOT
            #cloud-config
            
            # set locale
            locale: en_US.UTF-8
            # set timezone
            timezone: Etc/UTC
            
            hostname: kubic-2
            # you can also use ssh-keys with cloudinit. we use pwd for simplicity
            ssh_pwauth: True
            chpasswd:
              list: |
                 root:linux
              expire: False
            disable_root: false
            ssh_authorized_keys:
             - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv55y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPIQ0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared Key
            
            runcmd:
            #  - systemctl enable kubelet.service
            #  - systemctl enable --now crio.service
            #  - sed -i 's!KUBELET_EXTRA_ARGS="!KUBELET_EXTRA_ARGS="--cni-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet
              - sed  -i '/PermitRootLogin/s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config
              - systemctl restart sshd
              - modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4
            
            final_message: "The system is finally up, after $UPTIME seconds"
        EOT
    }

  # libvirt_domain.kubic_domain[0] will be created
  + resource "libvirt_domain" "kubic_domain" {
      + arch        = (known after apply)
      + cloudinit   = (known after apply)
      + cpu         = {
          + "mode" = "host-passthrough"
        }
      + emulator    = (known after apply)
      + fw_cfg_name = "opt/com.coreos/config"
      + id          = (known after apply)
      + machine     = (known after apply)
      + memory      = 2048
      + name        = "kubic-kubeadm-0"
      + qemu_agent  = false
      + running     = true
      + vcpu        = 2

      + disk {
          + volume_id = (known after apply)
        }
      + disk {
          + volume_id = (known after apply)
        }

      + network_interface {
          + addresses      = [
              + "10.16.0.0",
            ]
          + hostname       = "kubic-kubeadm-0"
          + mac            = (known after apply)
          + network_id     = (known after apply)
          + network_name   = "kubic-network"
          + wait_for_lease = true
        }
    }

  # libvirt_domain.kubic_domain[1] will be created
  + resource "libvirt_domain" "kubic_domain" {
      + arch        = (known after apply)
      + cloudinit   = (known after apply)
      + cpu         = {
          + "mode" = "host-passthrough"
        }
      + emulator    = (known after apply)
      + fw_cfg_name = "opt/com.coreos/config"
      + id          = (known after apply)
      + machine     = (known after apply)
      + memory      = 2048
      + name        = "kubic-kubeadm-1"
      + qemu_agent  = false
      + running     = true
      + vcpu        = 2

      + disk {
          + volume_id = (known after apply)
        }
      + disk {
          + volume_id = (known after apply)
        }

      + network_interface {
          + addresses      = [
              + "10.16.0.1",
            ]
          + hostname       = "kubic-kubeadm-1"
          + mac            = (known after apply)
          + network_id     = (known after apply)
          + network_name   = "kubic-network"
          + wait_for_lease = true
        }
    }

  # libvirt_domain.kubic_domain[2] will be created
  + resource "libvirt_domain" "kubic_domain" {
      + arch        = (known after apply)
      + cloudinit   = (known after apply)
      + cpu         = {
          + "mode" = "host-passthrough"
        }
      + emulator    = (known after apply)
      + fw_cfg_name = "opt/com.coreos/config"
      + id          = (known after apply)
      + machine     = (known after apply)
      + memory      = 2048
      + name        = "kubic-kubeadm-2"
      + qemu_agent  = false
      + running     = true
      + vcpu        = 2

      + disk {
          + volume_id = (known after apply)
        }
      + disk {
          + volume_id = (known after apply)
        }

      + network_interface {
          + addresses      = [
              + "10.16.0.2",
            ]
          + hostname       = "kubic-kubeadm-2"
          + mac            = (known after apply)
          + network_id     = (known after apply)
          + network_name   = "kubic-network"
          + wait_for_lease = true
        }
    }

  # libvirt_network.kubic_network will be created
  + resource "libvirt_network" "kubic_network" {
      + addresses = [
          + "10.16.0.0/24",
        ]
      + bridge    = (known after apply)
      + domain    = "kubic.local"
      + id        = (known after apply)
      + mode      = "nat"
      + name      = "kubic-network"

      + dns {
          + enabled    = true
          + local_only = false
        }
    }

  # libvirt_volume.data_volume[0] will be created
  + resource "libvirt_volume" "data_volume" {
      + format = (known after apply)
      + id     = (known after apply)
      + name   = "data_volume-0"
      + pool   = "default"
      + size   = 6442450944
    }

  # libvirt_volume.data_volume[1] will be created
  + resource "libvirt_volume" "data_volume" {
      + format = (known after apply)
      + id     = (known after apply)
      + name   = "data_volume-1"
      + pool   = "default"
      + size   = 6442450944
    }

  # libvirt_volume.data_volume[2] will be created
  + resource "libvirt_volume" "data_volume" {
      + format = (known after apply)
      + id     = (known after apply)
      + name   = "data_volume-2"
      + pool   = "default"
      + size   = 6442450944
    }

  # libvirt_volume.kubic_image will be created
  + resource "libvirt_volume" "kubic_image" {
      + format = (known after apply)
      + id     = (known after apply)
      + name   = "kubic_image"
      + pool   = "default"
      + size   = (known after apply)
      + source = "./kubic.qcow2"
    }

  # libvirt_volume.os_volume[0] will be created
  + resource "libvirt_volume" "os_volume" {
      + base_volume_id = (known after apply)
      + format         = (known after apply)
      + id             = (known after apply)
      + name           = "os_volume-0"
      + pool           = "default"
      + size           = (known after apply)
    }

  # libvirt_volume.os_volume[1] will be created
  + resource "libvirt_volume" "os_volume" {
      + base_volume_id = (known after apply)
      + format         = (known after apply)
      + id             = (known after apply)
      + name           = "os_volume-1"
      + pool           = "default"
      + size           = (known after apply)
    }

  # libvirt_volume.os_volume[2] will be created
  + resource "libvirt_volume" "os_volume" {
      + base_volume_id = (known after apply)
      + format         = (known after apply)
      + id             = (known after apply)
      + name           = "os_volume-2"
      + pool           = "default"
      + size           = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

geeko@portebla:~/sandbox/kubic-terraform-kvm> terraform apply
data.template_file.cloud_init_disk_user_data[0]: Refreshing state...
data.template_file.cloud_init_disk_user_data[2]: Refreshing state...
data.template_file.cloud_init_disk_user_data[1]: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # libvirt_cloudinit_disk.commoninit[0] will be created
  + resource "libvirt_cloudinit_disk" "commoninit" {
      + id        = (known after apply)
      + name      = "commoninit-0.iso"
      + pool      = "default"
      + user_data = <<~EOT
            #cloud-config
            
            # set locale
            locale: en_US.UTF-8
            # set timezone
            timezone: Etc/UTC
            
            hostname: kubic-0
            # you can also use ssh-keys with cloudinit. we use pwd for simplicity
            ssh_pwauth: True
            chpasswd:
              list: |
                 root:linux
              expire: False
            disable_root: false
            ssh_authorized_keys:
             - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv55y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPIQ0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared Key
            
            runcmd:
            #  - systemctl enable kubelet.service
            #  - systemctl enable --now crio.service
            #  - sed -i 's!KUBELET_EXTRA_ARGS="!KUBELET_EXTRA_ARGS="--cni-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet
              - sed  -i '/PermitRootLogin/s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config
              - systemctl restart sshd
              - modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4
            
            final_message: "The system is finally up, after $UPTIME seconds"
        EOT
    }

  # libvirt_cloudinit_disk.commoninit[1] will be created
  + resource "libvirt_cloudinit_disk" "commoninit" {
      + id        = (known after apply)
      + name      = "commoninit-1.iso"
      + pool      = "default"
      + user_data = <<~EOT
            #cloud-config
            
            # set locale
            locale: en_US.UTF-8
            # set timezone
            timezone: Etc/UTC
            
            hostname: kubic-1
            # you can also use ssh-keys with cloudinit. we use pwd for simplicity
            ssh_pwauth: True
            chpasswd:
              list: |
                 root:linux
              expire: False
            disable_root: false
            ssh_authorized_keys:
             - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv55y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPIQ0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared Key
            
            runcmd:
            #  - systemctl enable kubelet.service
            #  - systemctl enable --now crio.service
            #  - sed -i 's!KUBELET_EXTRA_ARGS="!KUBELET_EXTRA_ARGS="--cni-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet
              - sed  -i '/PermitRootLogin/s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config
              - systemctl restart sshd
              - modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4
            
            final_message: "The system is finally up, after $UPTIME seconds"
        EOT
    }

  # libvirt_cloudinit_disk.commoninit[2] will be created
  + resource "libvirt_cloudinit_disk" "commoninit" {
      + id        = (known after apply)
      + name      = "commoninit-2.iso"
      + pool      = "default"
      + user_data = <<~EOT
            #cloud-config
            
            # set locale
            locale: en_US.UTF-8
            # set timezone
            timezone: Etc/UTC
            
            hostname: kubic-2
            # you can also use ssh-keys with cloudinit. we use pwd for simplicity
            ssh_pwauth: True
            chpasswd:
              list: |
                 root:linux
              expire: False
            disable_root: false
            ssh_authorized_keys:
             - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv55y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPIQ0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared Key
            
            runcmd:
            #  - systemctl enable kubelet.service
            #  - systemctl enable --now crio.service
            #  - sed -i 's!KUBELET_EXTRA_ARGS="!KUBELET_EXTRA_ARGS="--cni-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet
              - sed  -i '/PermitRootLogin/s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config
              - systemctl restart sshd
              - modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4
            
            final_message: "The system is finally up, after $UPTIME seconds"
        EOT
    }

  # libvirt_domain.kubic_domain[0] will be created
  + resource "libvirt_domain" "kubic_domain" {
      + arch        = (known after apply)
      + cloudinit   = (known after apply)
      + cpu         = {
          + "mode" = "host-passthrough"
        }
      + emulator    = (known after apply)
      + fw_cfg_name = "opt/com.coreos/config"
      + id          = (known after apply)
      + machine     = (known after apply)
      + memory      = 2048
      + name        = "kubic-kubeadm-0"
      + qemu_agent  = false
      + running     = true
      + vcpu        = 2

      + disk {
          + volume_id = (known after apply)
        }
      + disk {
          + volume_id = (known after apply)
        }

      + network_interface {
          + addresses      = [
              + "10.16.0.0",
            ]
          + hostname       = "kubic-kubeadm-0"
          + mac            = (known after apply)
          + network_id     = (known after apply)
          + network_name   = "kubic-network"
          + wait_for_lease = true
        }
    }

  # libvirt_domain.kubic_domain[1] will be created
  + resource "libvirt_domain" "kubic_domain" {
      + arch        = (known after apply)
      + cloudinit   = (known after apply)
      + cpu         = {
          + "mode" = "host-passthrough"
        }
      + emulator    = (known after apply)
      + fw_cfg_name = "opt/com.coreos/config"
      + id          = (known after apply)
      + machine     = (known after apply)
      + memory      = 2048
      + name        = "kubic-kubeadm-1"
      + qemu_agent  = false
      + running     = true
      + vcpu        = 2

      + disk {
          + volume_id = (known after apply)
        }
      + disk {
          + volume_id = (known after apply)
        }

      + network_interface {
          + addresses      = [
              + "10.16.0.1",
            ]
          + hostname       = "kubic-kubeadm-1"
          + mac            = (known after apply)
          + network_id     = (known after apply)
          + network_name   = "kubic-network"
          + wait_for_lease = true
        }
    }

  # libvirt_domain.kubic_domain[2] will be created
  + resource "libvirt_domain" "kubic_domain" {
      + arch        = (known after apply)
      + cloudinit   = (known after apply)
      + cpu         = {
          + "mode" = "host-passthrough"
        }
      + emulator    = (known after apply)
      + fw_cfg_name = "opt/com.coreos/config"
      + id          = (known after apply)
      + machine     = (known after apply)
      + memory      = 2048
      + name        = "kubic-kubeadm-2"
      + qemu_agent  = false
      + running     = true
      + vcpu        = 2

      + disk {
          + volume_id = (known after apply)
        }
      + disk {
          + volume_id = (known after apply)
        }

      + network_interface {
          + addresses      = [
              + "10.16.0.2",
            ]
          + hostname       = "kubic-kubeadm-2"
          + mac            = (known after apply)
          + network_id     = (known after apply)
          + network_name   = "kubic-network"
          + wait_for_lease = true
        }
    }

  # libvirt_network.kubic_network will be created
  + resource "libvirt_network" "kubic_network" {
      + addresses = [
          + "10.16.0.0/24",
        ]
      + bridge    = (known after apply)
      + domain    = "kubic.local"
      + id        = (known after apply)
      + mode      = "nat"
      + name      = "kubic-network"

      + dns {
          + enabled    = true
          + local_only = false
        }
    }

  # libvirt_volume.data_volume[0] will be created
  + resource "libvirt_volume" "data_volume" {
      + format = (known after apply)
      + id     = (known after apply)
      + name   = "data_volume-0"
      + pool   = "default"
      + size   = 6442450944
    }

  # libvirt_volume.data_volume[1] will be created
  + resource "libvirt_volume" "data_volume" {
      + format = (known after apply)
      + id     = (known after apply)
      + name   = "data_volume-1"
      + pool   = "default"
      + size   = 6442450944
    }

  # libvirt_volume.data_volume[2] will be created
  + resource "libvirt_volume" "data_volume" {
      + format = (known after apply)
      + id     = (known after apply)
      + name   = "data_volume-2"
      + pool   = "default"
      + size   = 6442450944
    }

  # libvirt_volume.kubic_image will be created
  + resource "libvirt_volume" "kubic_image" {
      + format = (known after apply)
      + id     = (known after apply)
      + name   = "kubic_image"
      + pool   = "default"
      + size   = (known after apply)
      + source = "./kubic.qcow2"
    }

  # libvirt_volume.os_volume[0] will be created
  + resource "libvirt_volume" "os_volume" {
      + base_volume_id = (known after apply)
      + format         = (known after apply)
      + id             = (known after apply)
      + name           = "os_volume-0"
      + pool           = "default"
      + size           = (known after apply)
    }

  # libvirt_volume.os_volume[1] will be created
  + resource "libvirt_volume" "os_volume" {
      + base_volume_id = (known after apply)
      + format         = (known after apply)
      + id             = (known after apply)
      + name           = "os_volume-1"
      + pool           = "default"
      + size           = (known after apply)
    }

  # libvirt_volume.os_volume[2] will be created
  + resource "libvirt_volume" "os_volume" {
      + base_volume_id = (known after apply)
      + format         = (known after apply)
      + id             = (known after apply)
      + name           = "os_volume-2"
      + pool           = "default"
      + size           = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

libvirt_volume.data_volume[2]: Creating...
libvirt_volume.kubic_image: Creating...
libvirt_volume.data_volume[1]: Creating...
libvirt_volume.data_volume[0]: Creating...
libvirt_network.kubic_network: Creating...
libvirt_cloudinit_disk.commoninit[0]: Creating...
libvirt_cloudinit_disk.commoninit[2]: Creating...
libvirt_cloudinit_disk.commoninit[1]: Creating...
libvirt_volume.kubic_image: Creation complete after 1s [id=/var/lib/libvirt/images/kubic_image]
libvirt_volume.os_volume[2]: Creating...
libvirt_volume.os_volume[0]: Creating...
libvirt_volume.os_volume[1]: Creating...
libvirt_volume.data_volume[1]: Creation complete after 2s [id=/var/lib/libvirt/images/data_volume-1]
libvirt_volume.data_volume[2]: Creation complete after 2s [id=/var/lib/libvirt/images/data_volume-2]
libvirt_volume.data_volume[0]: Creation complete after 2s [id=/var/lib/libvirt/images/data_volume-0]
libvirt_cloudinit_disk.commoninit[2]: Creation complete after 2s [id=/var/lib/libvirt/images/commoninit-2.iso;5e6fe96d-97df-c1d6-40b9-f08bd26ed0f9]
libvirt_cloudinit_disk.commoninit[1]: Creation complete after 2s [id=/var/lib/libvirt/images/commoninit-1.iso;5e6fe96d-a4b2-f3a6-09f6-fe8e55bc7066]
libvirt_cloudinit_disk.commoninit[0]: Creation complete after 2s [id=/var/lib/libvirt/images/commoninit-0.iso;5e6fe96d-ef34-450c-6fdb-90dc17ddcb1d]
libvirt_volume.os_volume[2]: Creation complete after 2s [id=/var/lib/libvirt/images/os_volume-2]
libvirt_volume.os_volume[0]: Creation complete after 2s [id=/var/lib/libvirt/images/os_volume-0]
libvirt_volume.os_volume[1]: Creation complete after 2s [id=/var/lib/libvirt/images/os_volume-1]
libvirt_domain.kubic_domain[0]: Creating...
libvirt_domain.kubic_domain[1]: Creating...
libvirt_domain.kubic_domain[2]: Creating...
libvirt_network.kubic_network: Creation complete after 6s [id=dfd6a2dd-366c-4354-a7b9-a422487d5a2e]
libvirt_domain.kubic_domain[0]: Still creating... [10s elapsed]
libvirt_domain.kubic_domain[1]: Still creating... [10s elapsed]
libvirt_domain.kubic_domain[2]: Still creating... [10s elapsed]
libvirt_domain.kubic_domain[0]: Still creating... [20s elapsed]
libvirt_domain.kubic_domain[1]: Still creating... [20s elapsed]
libvirt_domain.kubic_domain[2]: Still creating... [20s elapsed]
libvirt_domain.kubic_domain[0]: Still creating... [30s elapsed]
libvirt_domain.kubic_domain[1]: Still creating... [30s elapsed]
libvirt_domain.kubic_domain[2]: Still creating... [30s elapsed]
libvirt_domain.kubic_domain[0]: Still creating... [40s elapsed]
libvirt_domain.kubic_domain[1]: Still creating... [40s elapsed]
libvirt_domain.kubic_domain[2]: Still creating... [40s elapsed]
libvirt_domain.kubic_domain[0]: Creation complete after 46s [id=c5fddb0f-d89b-4f7e-aec5-9af44e1410ec]
libvirt_domain.kubic_domain[1]: Creation complete after 46s [id=2bc4651c-962e-43f4-8604-cb908c456191]
libvirt_domain.kubic_domain[2]: Creation complete after 46s [id=f67f53b3-5cd8-46ba-a61e-e3eb7ced723d]

Apply complete! Resources: 14 added, 0 changed, 0 destroyed.

Outputs:

ips = [
  [
    "10.16.0.5",
  ],
  [
    "10.16.0.54",
  ],
  [
    "10.16.0.44",
  ],
]
geeko@portebla:~/sandbox/kubic-terraform-kvm> ./mk-ssh-config.sh 
./mk-ssh-config.sh: line 5: jq: command not found
geeko@portebla:~/sandbox/kubic-terraform-kvm> sudo zypper in jq
Retrieving repository 'Main Update Repository' metadata ..................[done]
Building repository 'Main Update Repository' cache .......................[done]
Loading repository data...
Reading installed packages...
Resolving package dependencies...

The following 3 NEW packages are going to be installed:
  jq libjq1 libonig4

3 new packages to install.
Overall download size: 295.6 KiB. Already cached: 0 B. After the operation,
additional 867.4 KiB will be used.
Continue? [y/n/v/...? shows all options] (y): 
Retrieving package libonig4-6.7.0-lp151.2.2.x86_64
                                           (1/3), 126.9 KiB (494.1 KiB unpacked)
Retrieving: libonig4-6.7.0-lp151.2.2.x86_64.rpm ...............[done (1022 B/s)]
Retrieving package libjq1-1.5-lp151.2.3.x86_64
                                           (2/3), 109.5 KiB (279.9 KiB unpacked)
Retrieving: libjq1-1.5-lp151.2.3.x86_64.rpm ................[done (292.3 KiB/s)]
Retrieving package jq-1.5-lp151.2.3.x86_64 (3/3),  59.2 KiB ( 93.4 KiB unpacked)
Retrieving: jq-1.5-lp151.2.3.x86_64.rpm ..................................[done]

Checking for file conflicts: .............................................[done]
(1/3) Installing: libonig4-6.7.0-lp151.2.2.x86_64 ........................[done]
(2/3) Installing: libjq1-1.5-lp151.2.3.x86_64 ............................[done]
(3/3) Installing: jq-1.5-lp151.2.3.x86_64 ................................[done]
geeko@portebla:~/sandbox/kubic-terraform-kvm> ./mk-ssh-config.sh 
geeko@portebla:~/sandbox/kubic-terraform-kvm> ssh -F ./ssh_config root@10.16.0.5
Warning: Permanently added '10.16.0.5' (ECDSA) to the list of known hosts.
Password: 
Password: 
Password: 
root@10.16.0.5's password: 
Permission denied, please try again.
root@10.16.0.5's password: 
Received disconnect from 10.16.0.5 port 22:2: Too many authentication failures
Disconnected from 10.16.0.5 port 22
geeko@portebla:~/sandbox/kubic-terraform-kvm> ls -lart
total 633168
drwxr-xr-x 9 geeko users       142 Mar 16 14:42 ..
-rw-r--r-- 1 geeko users       577 Mar 16 14:42 variables.tf
-rw-r--r-- 1 geeko users        45 Mar 16 14:42 terraform.tfvars.sample
-rw------- 1 geeko users      1675 Mar 16 14:42 ssh_id_shared
-rw-r--r-- 1 geeko users      2779 Mar 16 14:42 README.md
-rwxr-xr-x 1 geeko users       319 Mar 16 14:42 mk-ssh-config.sh
-rw-r--r-- 1 geeko users     11357 Mar 16 14:42 LICENSE
-rw-r--r-- 1 geeko users      1818 Mar 16 14:42 kubic-kvm.tf
-rw-r--r-- 1 geeko users       117 Mar 16 14:42 .gitignore
drwxr-xr-x 8 geeko users       163 Mar 16 14:42 .git
-rw-r--r-- 1 geeko users      1114 Mar 16 14:42 commoninit.cfg
-rwxr-xr-x 1 geeko users      1604 Mar 16 14:43 download-image.py
-rw-r--r-- 1 geeko users 648282112 Mar 16 14:55 kubic.qcow2
drwxr-xr-x 3 geeko users        21 Mar 16 15:02 .terraform
-rw-r--r-- 1 geeko users     26490 Mar 16 15:03 terraform.tfstate
drwxr-xr-x 4 geeko users       311 Mar 16 15:03 .
-rw-r--r-- 1 geeko users       180 Mar 16 15:04 ssh_config
geeko@portebla:~/sandbox/kubic-terraform-kvm> more terraform.tfstate 
{
  "version": 4,
  "terraform_version": "0.12.19",
  "serial": 15,
  "lineage": "74681aef-3ba9-2cf2-f695-9b27c041e392",
  "outputs": {
    "ips": {
      "value": [
        [
          "10.16.0.5"
        ],
        [
          "10.16.0.54"
        ],
        [
          "10.16.0.44"
        ]
      ],
      "type": [
        "tuple",
        [
          [
            "list",
            "string"
          ],
          [
            "list",
            "string"
          ],
          [
            "list",
            "string"
          ]
        ]
      ]
    }
  },
  "resources": [
    {
      "mode": "data",
      "type": "template_file",
      "name": "cloud_init_disk_user_data",
      "each": "list",
      "provider": "provider.template",
      "instances": [
        {
          "index_key": 0,
          "schema_version": 0,
          "attributes": {
            "filename": null,
            "id": "1992c57dc14496b7c4c5b11aa788b4f13afccc53aebc88a339887fc1fd5e7
790",
            "rendered": "#cloud-config\n\n# set locale\nlocale: en_US.UTF-8\n# s
et timezone\ntimezone: Etc/UTC\n\nhostname: kubic-0\n# you can also use ssh-keys
 with cloudinit. we use pwd for simplicity\nssh_pwauth: True\nchpasswd:\n  list:
 |\n     root:linux\n  expire: False\ndisable_root: false\nssh_authorized_keys:\
n - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+L
PAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU+
vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv55
y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPIQ
0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared K
ey\n\nruncmd:\n#  - systemctl enable kubelet.service\n#  - systemctl enable --no
w crio.service\n#  - sed -i 's!KUBELET_EXTRA_ARGS=\"!KUBELET_EXTRA_ARGS=\"--cni-
bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet\n  - sed  -i '/PermitRootLogin/s
/.*/PermitRootLogin yes/' /etc/ssh/sshd_config\n  - systemctl restart sshd\n  - 
modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4\n\nfinal_message: \"The s
ystem is finally up, after $UPTIME seconds\"\n",
            "template": "#cloud-config\n\n# set locale\nlocale: en_US.UTF-8\n# s
et timezone\ntimezone: Etc/UTC\n\nhostname: ${hostname}\n# you can also use ssh-
keys with cloudinit. we use pwd for simplicity\nssh_pwauth: True\nchpasswd:\n  l
ist: |\n     root:linux\n  expire: False\ndisable_root: false\nssh_authorized_ke
ys:\n - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxt
Xe+LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb
4eU+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3
Rv55y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NN
IPIQ0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shar
ed Key\n\nruncmd:\n#  - systemctl enable kubelet.service\n#  - systemctl enable 
--now crio.service\n#  - sed -i 's!KUBELET_EXTRA_ARGS=\"!KUBELET_EXTRA_ARGS=\"--
cni-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet\n  - sed  -i '/PermitRootLog
in/s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config\n  - systemctl restart sshd\n
  - modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4\n\nfinal_message: \"T
he system is finally up, after $UPTIME seconds\"\n",
            "vars": {
              "hostname": "kubic-0"
            }
          }
        },
        {
          "index_key": 1,
          "schema_version": 0,
          "attributes": {
            "filename": null,
            "id": "c0ea24bbee94d47119d45f7dbb2354d0717a2cb1b0e7723e9bb69ea050f44
1f2",
            "rendered": "#cloud-config\n\n# set locale\nlocale: en_US.UTF-8\n# s
et timezone\ntimezone: Etc/UTC\n\nhostname: kubic-1\n# you can also use ssh-keys
 with cloudinit. we use pwd for simplicity\nssh_pwauth: True\nchpasswd:\n  list:
 |\n     root:linux\n  expire: False\ndisable_root: false\nssh_authorized_keys:\
n - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+L
PAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU+
vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv55
y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPIQ
0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared K
ey\n\nruncmd:\n#  - systemctl enable kubelet.service\n#  - systemctl enable --no
w crio.service\n#  - sed -i 's!KUBELET_EXTRA_ARGS=\"!KUBELET_EXTRA_ARGS=\"--cni-
bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet\n  - sed  -i '/PermitRootLogin/s
/.*/PermitRootLogin yes/' /etc/ssh/sshd_config\n  - systemctl restart sshd\n  - 
modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4\n\nfinal_message: \"The s
ystem is finally up, after $UPTIME seconds\"\n",
            "template": "#cloud-config\n\n# set locale\nlocale: en_US.UTF-8\n# s
et timezone\ntimezone: Etc/UTC\n\nhostname: ${hostname}\n# you can also use ssh-
keys with cloudinit. we use pwd for simplicity\nssh_pwauth: True\nchpasswd:\n  l
ist: |\n     root:linux\n  expire: False\ndisable_root: false\nssh_authorized_ke
ys:\n - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxt
Xe+LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb
4eU+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3
Rv55y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NN
IPIQ0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shar
ed Key\n\nruncmd:\n#  - systemctl enable kubelet.service\n#  - systemctl enable 
--now crio.service\n#  - sed -i 's!KUBELET_EXTRA_ARGS=\"!KUBELET_EXTRA_ARGS=\"--
cni-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet\n  - sed  -i '/PermitRootLog
in/s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config\n  - systemctl restart sshd\n
  - modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4\n\nfinal_message: \"T
he system is finally up, after $UPTIME seconds\"\n",
            "vars": {
              "hostname": "kubic-1"
            }
          }
        },
        {
          "index_key": 2,
          "schema_version": 0,
          "attributes": {
            "filename": null,
            "id": "f27c25bb6705050f665698c42202fa5240ad787ced456791e89d5403e6172
294",
            "rendered": "#cloud-config\n\n# set locale\nlocale: en_US.UTF-8\n# s
et timezone\ntimezone: Etc/UTC\n\nhostname: kubic-2\n# you can also use ssh-keys
 with cloudinit. we use pwd for simplicity\nssh_pwauth: True\nchpasswd:\n  list:
 |\n     root:linux\n  expire: False\ndisable_root: false\nssh_authorized_keys:\
n - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+L
PAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU+
vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv55
y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPIQ
0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared K
ey\n\nruncmd:\n#  - systemctl enable kubelet.service\n#  - systemctl enable --no
w crio.service\n#  - sed -i 's!KUBELET_EXTRA_ARGS=\"!KUBELET_EXTRA_ARGS=\"--cni-
bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet\n  - sed  -i '/PermitRootLogin/s
/.*/PermitRootLogin yes/' /etc/ssh/sshd_config\n  - systemctl restart sshd\n  - 
modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4\n\nfinal_message: \"The s
ystem is finally up, after $UPTIME seconds\"\n",
            "template": "#cloud-config\n\n# set locale\nlocale: en_US.UTF-8\n# s
et timezone\ntimezone: Etc/UTC\n\nhostname: ${hostname}\n# you can also use ssh-
keys with cloudinit. we use pwd for simplicity\nssh_pwauth: True\nchpasswd:\n  l
ist: |\n     root:linux\n  expire: False\ndisable_root: false\nssh_authorized_ke
ys:\n - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxt
Xe+LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb
4eU+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3
Rv55y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NN
IPIQ0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shar
ed Key\n\nruncmd:\n#  - systemctl enable kubelet.service\n#  - systemctl enable 
--now crio.service\n#  - sed -i 's!KUBELET_EXTRA_ARGS=\"!KUBELET_EXTRA_ARGS=\"--
cni-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet\n  - sed  -i '/PermitRootLog
in/s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config\n  - systemctl restart sshd\n
  - modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4\n\nfinal_message: \"T
he system is finally up, after $UPTIME seconds\"\n",
            "vars": {
              "hostname": "kubic-2"
            }
          }
        }
      ]
    },
    {
      "mode": "managed",
      "type": "libvirt_cloudinit_disk",
      "name": "commoninit",
      "each": "list",
      "provider": "provider.libvirt",
      "instances": [
        {
          "index_key": 0,
          "schema_version": 0,
          "attributes": {
            "id": "/var/lib/libvirt/images/commoninit-0.iso;5e6fe96d-ef34-450c-6
fdb-90dc17ddcb1d",
            "meta_data": "",
            "name": "commoninit-0.iso",
            "network_config": "",
            "pool": "default",
            "user_data": "#cloud-config\n\n# set locale\nlocale: en_US.UTF-8\n# 
set timezone\ntimezone: Etc/UTC\n\nhostname: kubic-0\n# you can also use ssh-key
s with cloudinit. we use pwd for simplicity\nssh_pwauth: True\nchpasswd:\n  list
: |\n     root:linux\n  expire: False\ndisable_root: false\nssh_authorized_keys:
\n - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+
LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU
+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv5
5y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPI
Q0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared 
Key\n\nruncmd:\n#  - systemctl enable kubelet.service\n#  - systemctl enable --n
ow crio.service\n#  - sed -i 's!KUBELET_EXTRA_ARGS=\"!KUBELET_EXTRA_ARGS=\"--cni
-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet\n  - sed  -i '/PermitRootLogin/
s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config\n  - systemctl restart sshd\n  -
 modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4\n\nfinal_message: \"The 
system is finally up, after $UPTIME seconds\"\n"
          },
          "private": "bnVsbA=="
        },
        {
          "index_key": 1,
          "schema_version": 0,
          "attributes": {
            "id": "/var/lib/libvirt/images/commoninit-1.iso;5e6fe96d-a4b2-f3a6-0
9f6-fe8e55bc7066",
            "meta_data": "",
            "name": "commoninit-1.iso",
            "network_config": "",
            "pool": "default",
            "user_data": "#cloud-config\n\n# set locale\nlocale: en_US.UTF-8\n# 
set timezone\ntimezone: Etc/UTC\n\nhostname: kubic-1\n# you can also use ssh-key
s with cloudinit. we use pwd for simplicity\nssh_pwauth: True\nchpasswd:\n  list
: |\n     root:linux\n  expire: False\ndisable_root: false\nssh_authorized_keys:
\n - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+
LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU
+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv5
5y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPI
Q0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared 
Key\n\nruncmd:\n#  - systemctl enable kubelet.service\n#  - systemctl enable --n
ow crio.service\n#  - sed -i 's!KUBELET_EXTRA_ARGS=\"!KUBELET_EXTRA_ARGS=\"--cni
-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet\n  - sed  -i '/PermitRootLogin/
s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config\n  - systemctl restart sshd\n  -
 modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4\n\nfinal_message: \"The 
system is finally up, after $UPTIME seconds\"\n"
          },
          "private": "bnVsbA=="
        },
        {
          "index_key": 2,
          "schema_version": 0,
          "attributes": {
            "id": "/var/lib/libvirt/images/commoninit-2.iso;5e6fe96d-97df-c1d6-4
0b9-f08bd26ed0f9",
            "meta_data": "",
            "name": "commoninit-2.iso",
            "network_config": "",
            "pool": "default",
            "user_data": "#cloud-config\n\n# set locale\nlocale: en_US.UTF-8\n# 
set timezone\ntimezone: Etc/UTC\n\nhostname: kubic-2\n# you can also use ssh-key
s with cloudinit. we use pwd for simplicity\nssh_pwauth: True\nchpasswd:\n  list
: |\n     root:linux\n  expire: False\ndisable_root: false\nssh_authorized_keys:
\n - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC2G7k0zGAjd+0LzhbPcGLkdJrJ/LbLrFxtXe+
LPAkrphizfRxdZpSC7Dvr5Vewrkd/kfYObiDc6v23DHxzcilVC2HGLQUNeUer/YE1mL4lnXC1M3cb4eU
+vJ/Gyr9XVOOReDRDBCwouaL7IzgYNCsm0O5v2z/w9ugnRLryUY180/oIGeE/aOI1HRh6YOsIn7R3Rv5
5y8CYSqsbmlHWiDC6iZICZtvYLYmUmCgPX2Fg2eT+aRbAStUcUERm8h246fs1KxywdHHI/6o3E1NNIPI
Q0LdzIn5aWvTCd6D511L4rf/k5zbdw/Gql0AygHBR/wnngB5gSDERLKfigzeIlCKf Unsafe Shared 
Key\n\nruncmd:\n#  - systemctl enable kubelet.service\n#  - systemctl enable --n
ow crio.service\n#  - sed -i 's!KUBELET_EXTRA_ARGS=\"!KUBELET_EXTRA_ARGS=\"--cni
-bin-dir=/usr/lib/cni !g' /etc/sysconfig/kubelet\n  - sed  -i '/PermitRootLogin/
s/.*/PermitRootLogin yes/' /etc/ssh/sshd_config\n  - systemctl restart sshd\n  -
 modprobe ip_vs_rr ip_vs_sh ip_vs_wrr nf_conntrack_ipv4\n\nfinal_message: \"The 
system is finally up, after $UPTIME seconds\"\n"
          },
          "private": "bnVsbA=="
        }
      ]
    },
    {
      "mode": "managed",
      "type": "libvirt_domain",
      "name": "kubic_domain",
      "each": "list",
      "provider": "provider.libvirt",
      "instances": [
        {
          "index_key": 0,
          "schema_version": 0,
          "attributes": {
            "arch": "x86_64",
            "autostart": false,
            "boot_device": [],
            "cloudinit": "/var/lib/libvirt/images/commoninit-0.iso;5e6fe96d-ef34
-450c-6fdb-90dc17ddcb1d",
            "cmdline": null,
            "console": [],
            "coreos_ignition": null,
            "cpu": {
              "mode": "host-passthrough"
            },
            "disk": [
              {
                "block_device": "",
                "file": "",
                "scsi": false,
                "url": "",
                "volume_id": "/var/lib/libvirt/images/os_volume-0",
                "wwn": ""
              },
              {
                "block_device": "",
                "file": "",
                "scsi": false,
                "url": "",
                "volume_id": "/var/lib/libvirt/images/data_volume-0",
                "wwn": ""
              }
            ],
            "emulator": "/usr/bin/qemu-system-x86_64",
            "filesystem": [],
            "firmware": "",
            "fw_cfg_name": "opt/com.coreos/config",
            "graphics": [],
            "id": "c5fddb0f-d89b-4f7e-aec5-9af44e1410ec",
            "initrd": "",
            "kernel": "",
            "machine": "pc",
            "memory": 2048,
            "metadata": null,
            "name": "kubic-kubeadm-0",
            "network_interface": [
              {
                "addresses": [
                  "10.16.0.5"
                ],
                "bridge": "",
                "hostname": "",
                "mac": "52:54:00:BE:BC:1F",
                "macvtap": "",
                "network_id": "dfd6a2dd-366c-4354-a7b9-a422487d5a2e",
                "network_name": "kubic-network",
                "passthrough": "",
                "vepa": "",
                "wait_for_lease": true
              }
            ],
            "nvram": [],
            "qemu_agent": false,
            "running": true,
            "timeouts": null,
            "vcpu": 2,
            "video": [],
            "xml": []
          },
          "private": "eyJlMmJmYjczMC1lY2FhLTExZTYtOGY4OC0zNDM2M2JjN2M0YzAiOnsiY3
JlYXRlIjozMDAwMDAwMDAwMDB9fQ==",
          "dependencies": [
            "libvirt_cloudinit_disk.commoninit",
            "libvirt_volume.data_volume",
            "libvirt_volume.kubic_image",
            "libvirt_volume.os_volume"
          ]
        },
        {
          "index_key": 1,
          "schema_version": 0,
          "attributes": {
            "arch": "x86_64",
            "autostart": false,
            "boot_device": [],
            "cloudinit": "/var/lib/libvirt/images/commoninit-1.iso;5e6fe96d-a4b2
-f3a6-09f6-fe8e55bc7066",
            "cmdline": null,
            "console": [],
            "coreos_ignition": null,
            "cpu": {
              "mode": "host-passthrough"
            },
            "disk": [
              {
                "block_device": "",
                "file": "",
                "scsi": false,
                "url": "",
                "volume_id": "/var/lib/libvirt/images/os_volume-1",
                "wwn": ""
              },
              {
                "block_device": "",
                "file": "",
                "scsi": false,
                "url": "",
                "volume_id": "/var/lib/libvirt/images/data_volume-1",
                "wwn": ""
              }
            ],
            "emulator": "/usr/bin/qemu-system-x86_64",
            "filesystem": [],
            "firmware": "",
            "fw_cfg_name": "opt/com.coreos/config",
            "graphics": [],
            "id": "2bc4651c-962e-43f4-8604-cb908c456191",
            "initrd": "",
            "kernel": "",
            "machine": "pc",
            "memory": 2048,
            "metadata": null,
            "name": "kubic-kubeadm-1",
            "network_interface": [
              {
                "addresses": [
                  "10.16.0.54"
                ],
                "bridge": "",
                "hostname": "",
                "mac": "52:54:00:CE:C0:74",
                "macvtap": "",
                "network_id": "dfd6a2dd-366c-4354-a7b9-a422487d5a2e",
                "network_name": "kubic-network",
                "passthrough": "",
                "vepa": "",
                "wait_for_lease": true
              }
            ],
            "nvram": [],
            "qemu_agent": false,
            "running": true,
            "timeouts": null,
            "vcpu": 2,
            "video": [],
            "xml": []
          },
          "private": "eyJlMmJmYjczMC1lY2FhLTExZTYtOGY4OC0zNDM2M2JjN2M0YzAiOnsiY3
JlYXRlIjozMDAwMDAwMDAwMDB9fQ==",
          "dependencies": [
            "libvirt_cloudinit_disk.commoninit",
            "libvirt_volume.data_volume",
            "libvirt_volume.kubic_image",
            "libvirt_volume.os_volume"
          ]
        },
        {
          "index_key": 2,
          "schema_version": 0,
          "attributes": {
            "arch": "x86_64",
            "autostart": false,
            "boot_device": [],
            "cloudinit": "/var/lib/libvirt/images/commoninit-2.iso;5e6fe96d-97df
-c1d6-40b9-f08bd26ed0f9",
            "cmdline": null,
            "console": [],
            "coreos_ignition": null,
            "cpu": {
              "mode": "host-passthrough"
            },
            "disk": [
              {
                "block_device": "",
                "file": "",
                "scsi": false,
                "url": "",
                "volume_id": "/var/lib/libvirt/images/os_volume-2",
                "wwn": ""
              },
              {
                "block_device": "",
                "file": "",
                "scsi": false,
                "url": "",
                "volume_id": "/var/lib/libvirt/images/data_volume-2",
                "wwn": ""
              }
            ],
            "emulator": "/usr/bin/qemu-system-x86_64",
            "filesystem": [],
            "firmware": "",
            "fw_cfg_name": "opt/com.coreos/config",
            "graphics": [],
            "id": "f67f53b3-5cd8-46ba-a61e-e3eb7ced723d",
            "initrd": "",
            "kernel": "",
            "machine": "pc",
            "memory": 2048,
            "metadata": null,
            "name": "kubic-kubeadm-2",
            "network_interface": [
              {
                "addresses": [
                  "10.16.0.44"
                ],
                "bridge": "",
                "hostname": "",
                "mac": "52:54:00:16:C6:F9",
                "macvtap": "",
                "network_id": "dfd6a2dd-366c-4354-a7b9-a422487d5a2e",
                "network_name": "kubic-network",
                "passthrough": "",
                "vepa": "",
                "wait_for_lease": true
              }
            ],
            "nvram": [],
            "qemu_agent": false,
            "running": true,
            "timeouts": null,
            "vcpu": 2,
            "video": [],
            "xml": []
          },
          "private": "eyJlMmJmYjczMC1lY2FhLTExZTYtOGY4OC0zNDM2M2JjN2M0YzAiOnsiY3
JlYXRlIjozMDAwMDAwMDAwMDB9fQ==",
          "dependencies": [
            "libvirt_cloudinit_disk.commoninit",
            "libvirt_volume.data_volume",
            "libvirt_volume.kubic_image",
            "libvirt_volume.os_volume"
          ]
        }
      ]
    },
    {
      "mode": "managed",
      "type": "libvirt_network",
      "name": "kubic_network",
      "provider": "provider.libvirt",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "addresses": [
              "10.16.0.0/24"
            ],
            "autostart": false,
            "bridge": "virbr1",
            "dhcp": [],
            "dns": [
              {
                "enabled": true,
                "forwarders": [],
                "hosts": [],
                "local_only": false,
                "srvs": []
              }
            ],
            "domain": "kubic.local",
            "id": "dfd6a2dd-366c-4354-a7b9-a422487d5a2e",
            "mode": "nat",
            "mtu": null,
            "name": "kubic-network",
            "routes": [],
            "xml": []
          },
          "private": "bnVsbA=="
        }
      ]
    },
    {
      "mode": "managed",
      "type": "libvirt_volume",
      "name": "data_volume",
      "each": "list",
      "provider": "provider.libvirt",
      "instances": [
        {
          "index_key": 0,
          "schema_version": 0,
          "attributes": {
            "base_volume_id": null,
            "base_volume_name": null,
            "base_volume_pool": null,
            "format": "qcow2",
            "id": "/var/lib/libvirt/images/data_volume-0",
            "name": "data_volume-0",
            "pool": "default",
            "size": 6442450944,
            "source": null,
            "xml": []
          },
          "private": "bnVsbA=="
        },
        {
          "index_key": 1,
          "schema_version": 0,
          "attributes": {
            "base_volume_id": null,
            "base_volume_name": null,
            "base_volume_pool": null,
            "format": "qcow2",
            "id": "/var/lib/libvirt/images/data_volume-1",
            "name": "data_volume-1",
            "pool": "default",
            "size": 6442450944,
            "source": null,
            "xml": []
          },
          "private": "bnVsbA=="
        },
        {
          "index_key": 2,
          "schema_version": 0,
          "attributes": {
            "base_volume_id": null,
            "base_volume_name": null,
            "base_volume_pool": null,
            "format": "qcow2",
            "id": "/var/lib/libvirt/images/data_volume-2",
            "name": "data_volume-2",
            "pool": "default",
            "size": 6442450944,
            "source": null,
            "xml": []
          },
          "private": "bnVsbA=="
        }
      ]
    },
    {
      "mode": "managed",
      "type": "libvirt_volume",
      "name": "kubic_image",
      "provider": "provider.libvirt",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "base_volume_id": null,
            "base_volume_name": null,
            "base_volume_pool": null,
            "format": "qcow2",
            "id": "/var/lib/libvirt/images/kubic_image",
            "name": "kubic_image",
            "pool": "default",
            "size": 21474836480,
            "source": "./kubic.qcow2",
            "xml": []
          },
          "private": "bnVsbA=="
        }
      ]
    },
    {
      "mode": "managed",
      "type": "libvirt_volume",
      "name": "os_volume",
      "each": "list",
      "provider": "provider.libvirt",
      "instances": [
        {
          "index_key": 0,
          "schema_version": 0,
          "attributes": {
            "base_volume_id": "/var/lib/libvirt/images/kubic_image",
            "base_volume_name": null,
            "base_volume_pool": null,
            "format": "qcow2",
            "id": "/var/lib/libvirt/images/os_volume-0",
            "name": "os_volume-0",
            "pool": "default",
            "size": 21474836480,
            "source": null,
            "xml": []
          },
          "private": "bnVsbA==",
          "dependencies": [
            "libvirt_volume.kubic_image"
          ]
        },
        {
          "index_key": 1,
          "schema_version": 0,
          "attributes": {
            "base_volume_id": "/var/lib/libvirt/images/kubic_image",
            "base_volume_name": null,
            "base_volume_pool": null,
            "format": "qcow2",
            "id": "/var/lib/libvirt/images/os_volume-1",
            "name": "os_volume-1",
            "pool": "default",
            "size": 21474836480,
            "source": null,
            "xml": []
          },
          "private": "bnVsbA==",
          "dependencies": [
            "libvirt_volume.kubic_image"
          ]
        },
        {
          "index_key": 2,
          "schema_version": 0,
          "attributes": {
            "base_volume_id": "/var/lib/libvirt/images/kubic_image",
            "base_volume_name": null,
            "base_volume_pool": null,
            "format": "qcow2",
            "id": "/var/lib/libvirt/images/os_volume-2",
            "name": "os_volume-2",
            "pool": "default",
            "size": 21474836480,
            "source": null,
            "xml": []
          },
          "private": "bnVsbA==",
          "dependencies": [
            "libvirt_volume.kubic_image"
          ]
        }
      ]
    }
  ]
}
  

